dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxGeth_bf.h
/** \brief Mask for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.EIPGEN */
#define IFX_GETH_MAC_EXT_CONFIGURATION_EIPGEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.EIPGEN */
#define IFX_GETH_MAC_EXT_CONFIGURATION_EIPGEN_OFF (24u)

/** \brief Length for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.EIPG */
#define IFX_GETH_MAC_EXT_CONFIGURATION_EIPG_LEN (5u)

/** \brief Mask for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.EIPG */
#define IFX_GETH_MAC_EXT_CONFIGURATION_EIPG_MSK (0x1fu)

/** \brief Offset for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.EIPG */
#define IFX_GETH_MAC_EXT_CONFIGURATION_EIPG_OFF (25u)

/** \brief Length for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.FHE */
#define IFX_GETH_MAC_EXT_CONFIGURATION_FHE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.FHE */
#define IFX_GETH_MAC_EXT_CONFIGURATION_FHE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.FHE */
#define IFX_GETH_MAC_EXT_CONFIGURATION_FHE_OFF (31u)

/** \brief Length for Ifx_GETH_MAC_PACKET_FILTER_Bits.PR */
#define IFX_GETH_MAC_PACKET_FILTER_PR_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PACKET_FILTER_Bits.PR */
#define IFX_GETH_MAC_PACKET_FILTER_PR_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PACKET_FILTER_Bits.PR */
#define IFX_GETH_MAC_PACKET_FILTER_PR_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_PACKET_FILTER_Bits.DAIF */
#define IFX_GETH_MAC_PACKET_FILTER_DAIF_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PACKET_FILTER_Bits.DAIF */
#define IFX_GETH_MAC_PACKET_FILTER_DAIF_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PACKET_FILTER_Bits.DAIF */
#define IFX_GETH_MAC_PACKET_FILTER_DAIF_OFF (3u)

/** \brief Length for Ifx_GETH_MAC_PACKET_FILTER_Bits.PM */
#define IFX_GETH_MAC_PACKET_FILTER_PM_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PACKET_FILTER_Bits.PM */
#define IFX_GETH_MAC_PACKET_FILTER_PM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PACKET_FILTER_Bits.PM */
#define IFX_GETH_MAC_PACKET_FILTER_PM_OFF (4u)

/** \brief Length for Ifx_GETH_MAC_PACKET_FILTER_Bits.DBF */
#define IFX_GETH_MAC_PACKET_FILTER_DBF_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PACKET_FILTER_Bits.DBF */
#define IFX_GETH_MAC_PACKET_FILTER_DBF_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PACKET_FILTER_Bits.DBF */
#define IFX_GETH_MAC_PACKET_FILTER_DBF_OFF (5u)

/** \brief Length for Ifx_GETH_MAC_PACKET_FILTER_Bits.PCF */
#define IFX_GETH_MAC_PACKET_FILTER_PCF_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_PACKET_FILTER_Bits.PCF */
#define IFX_GETH_MAC_PACKET_FILTER_PCF_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_PACKET_FILTER_Bits.PCF */
#define IFX_GETH_MAC_PACKET_FILTER_PCF_OFF (6u)

/** \brief Length for Ifx_GETH_MAC_PACKET_FILTER_Bits.SAIF */
#define IFX_GETH_MAC_PACKET_FILTER_SAIF_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PACKET_FILTER_Bits.SAIF */
#define IFX_GETH_MAC_PACKET_FILTER_SAIF_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PACKET_FILTER_Bits.SAIF */
#define IFX_GETH_MAC_PACKET_FILTER_SAIF_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_PACKET_FILTER_Bits.SAF */
#define IFX_GETH_MAC_PACKET_FILTER_SAF_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PACKET_FILTER_Bits.SAF */
#define IFX_GETH_MAC_PACKET_FILTER_SAF_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PACKET_FILTER_Bits.SAF */
#define IFX_GETH_MAC_PACKET_FILTER_SAF_OFF (9u)

/** \brief Length for Ifx_GETH_MAC_PACKET_FILTER_Bits.VTFE */
#define IFX_GETH_MAC_PACKET_FILTER_VTFE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PACKET_FILTER_Bits.VTFE */
#define IFX_GETH_MAC_PACKET_FILTER_VTFE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PACKET_FILTER_Bits.VTFE */
#define IFX_GETH_MAC_PACKET_FILTER_VTFE_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_PACKET_FILTER_Bits.RA */
#define IFX_GETH_MAC_PACKET_FILTER_RA_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PACKET_FILTER_Bits.RA */
#define IFX_GETH_MAC_PACKET_FILTER_RA_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PACKET_FILTER_Bits.RA */
#define IFX_GETH_MAC_PACKET_FILTER_RA_OFF (31u)

/** \brief Length for Ifx_GETH_MAC_WATCHDOG_TIMEOUT_Bits.WTO */
#define IFX_GETH_MAC_WATCHDOG_TIMEOUT_WTO_LEN (4u)

/** \brief Mask for Ifx_GETH_MAC_WATCHDOG_TIMEOUT_Bits.WTO */
#define IFX_GETH_MAC_WATCHDOG_TIMEOUT_WTO_MSK (0xfu)

/** \brief Offset for Ifx_GETH_MAC_WATCHDOG_TIMEOUT_Bits.WTO */
#define IFX_GETH_MAC_WATCHDOG_TIMEOUT_WTO_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_WATCHDOG_TIMEOUT_Bits.PWE */
#define IFX_GETH_MAC_WATCHDOG_TIMEOUT_PWE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_WATCHDOG_TIMEOUT_Bits.PWE */
#define IFX_GETH_MAC_WATCHDOG_TIMEOUT_PWE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_WATCHDOG_TIMEOUT_Bits.PWE */
#define IFX_GETH_MAC_WATCHDOG_TIMEOUT_PWE_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.OB */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_OB_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.OB */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_OB_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.OB */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_OB_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.CT */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_CT_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.CT */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_CT_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.CT */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_CT_OFF (1u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.OFS */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_OFS_LEN (5u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.OFS */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_OFS_MSK (0x1fu)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.OFS */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_OFS_OFF (2u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.VTIM */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_VTIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.VTIM */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_VTIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.VTIM */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_VTIM_OFF (17u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.ESVL */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_ESVL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.ESVL */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_ESVL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.ESVL */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_ESVL_OFF (18u)

