dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxGeth_bf.h
/** \brief Offset for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.LPIEN */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_LPIEN_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.PLS */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_PLS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.PLS */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_PLS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.PLS */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_PLS_OFF (17u)

/** \brief Length for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.PLSEN */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_PLSEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.PLSEN */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_PLSEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.PLSEN */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_PLSEN_OFF (18u)

/** \brief Length for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.LPITXA */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_LPITXA_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.LPITXA */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_LPITXA_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.LPITXA */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_LPITXA_OFF (19u)

/** \brief Length for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.LPIATE */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_LPIATE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.LPIATE */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_LPIATE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.LPIATE */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_LPIATE_OFF (20u)

/** \brief Length for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.LPITCSE */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_LPITCSE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.LPITCSE */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_LPITCSE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.LPITCSE */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_LPITCSE_OFF (21u)

/** \brief Length for Ifx_GETH_MAC_LPI_TIMERS_CONTROL_Bits.TWT */
#define IFX_GETH_MAC_LPI_TIMERS_CONTROL_TWT_LEN (16u)

/** \brief Mask for Ifx_GETH_MAC_LPI_TIMERS_CONTROL_Bits.TWT */
#define IFX_GETH_MAC_LPI_TIMERS_CONTROL_TWT_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_MAC_LPI_TIMERS_CONTROL_Bits.TWT */
#define IFX_GETH_MAC_LPI_TIMERS_CONTROL_TWT_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_LPI_TIMERS_CONTROL_Bits.LST */
#define IFX_GETH_MAC_LPI_TIMERS_CONTROL_LST_LEN (10u)

/** \brief Mask for Ifx_GETH_MAC_LPI_TIMERS_CONTROL_Bits.LST */
#define IFX_GETH_MAC_LPI_TIMERS_CONTROL_LST_MSK (0x3ffu)

/** \brief Offset for Ifx_GETH_MAC_LPI_TIMERS_CONTROL_Bits.LST */
#define IFX_GETH_MAC_LPI_TIMERS_CONTROL_LST_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_LPI_ENTRY_TIMER_Bits.LPIET */
#define IFX_GETH_MAC_LPI_ENTRY_TIMER_LPIET_LEN (17u)

/** \brief Mask for Ifx_GETH_MAC_LPI_ENTRY_TIMER_Bits.LPIET */
#define IFX_GETH_MAC_LPI_ENTRY_TIMER_LPIET_MSK (0x1ffffu)

/** \brief Offset for Ifx_GETH_MAC_LPI_ENTRY_TIMER_Bits.LPIET */
#define IFX_GETH_MAC_LPI_ENTRY_TIMER_LPIET_OFF (3u)

/** \brief Length for Ifx_GETH_MAC_1US_TIC_COUNTER_Bits.TIC_1US_CNTR */
#define IFX_GETH_MAC_1US_TIC_COUNTER_TIC_1US_CNTR_LEN (12u)

/** \brief Mask for Ifx_GETH_MAC_1US_TIC_COUNTER_Bits.TIC_1US_CNTR */
#define IFX_GETH_MAC_1US_TIC_COUNTER_TIC_1US_CNTR_MSK (0xfffu)

/** \brief Offset for Ifx_GETH_MAC_1US_TIC_COUNTER_Bits.TIC_1US_CNTR */
#define IFX_GETH_MAC_1US_TIC_COUNTER_TIC_1US_CNTR_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_PHYIF_CONTROL_STATUS_Bits.TC */
#define IFX_GETH_MAC_PHYIF_CONTROL_STATUS_TC_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PHYIF_CONTROL_STATUS_Bits.TC */
#define IFX_GETH_MAC_PHYIF_CONTROL_STATUS_TC_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PHYIF_CONTROL_STATUS_Bits.TC */
#define IFX_GETH_MAC_PHYIF_CONTROL_STATUS_TC_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_PHYIF_CONTROL_STATUS_Bits.LUD */
#define IFX_GETH_MAC_PHYIF_CONTROL_STATUS_LUD_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PHYIF_CONTROL_STATUS_Bits.LUD */
#define IFX_GETH_MAC_PHYIF_CONTROL_STATUS_LUD_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PHYIF_CONTROL_STATUS_Bits.LUD */
#define IFX_GETH_MAC_PHYIF_CONTROL_STATUS_LUD_OFF (1u)

/** \brief Length for Ifx_GETH_MAC_PHYIF_CONTROL_STATUS_Bits.LNKMOD */
#define IFX_GETH_MAC_PHYIF_CONTROL_STATUS_LNKMOD_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PHYIF_CONTROL_STATUS_Bits.LNKMOD */
#define IFX_GETH_MAC_PHYIF_CONTROL_STATUS_LNKMOD_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PHYIF_CONTROL_STATUS_Bits.LNKMOD */
#define IFX_GETH_MAC_PHYIF_CONTROL_STATUS_LNKMOD_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_PHYIF_CONTROL_STATUS_Bits.LNKSPEED */
#define IFX_GETH_MAC_PHYIF_CONTROL_STATUS_LNKSPEED_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_PHYIF_CONTROL_STATUS_Bits.LNKSPEED */
#define IFX_GETH_MAC_PHYIF_CONTROL_STATUS_LNKSPEED_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_PHYIF_CONTROL_STATUS_Bits.LNKSPEED */
#define IFX_GETH_MAC_PHYIF_CONTROL_STATUS_LNKSPEED_OFF (17u)

/** \brief Length for Ifx_GETH_MAC_PHYIF_CONTROL_STATUS_Bits.LNKSTS */
#define IFX_GETH_MAC_PHYIF_CONTROL_STATUS_LNKSTS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PHYIF_CONTROL_STATUS_Bits.LNKSTS */
#define IFX_GETH_MAC_PHYIF_CONTROL_STATUS_LNKSTS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PHYIF_CONTROL_STATUS_Bits.LNKSTS */
#define IFX_GETH_MAC_PHYIF_CONTROL_STATUS_LNKSTS_OFF (19u)

/** \brief Length for Ifx_GETH_MAC_VERSION_Bits.SNPSVER */
#define IFX_GETH_MAC_VERSION_SNPSVER_LEN (8u)

/** \brief Mask for Ifx_GETH_MAC_VERSION_Bits.SNPSVER */
#define IFX_GETH_MAC_VERSION_SNPSVER_MSK (0xffu)

/** \brief Offset for Ifx_GETH_MAC_VERSION_Bits.SNPSVER */
#define IFX_GETH_MAC_VERSION_SNPSVER_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_VERSION_Bits.USERVER */
#define IFX_GETH_MAC_VERSION_USERVER_LEN (8u)

/** \brief Mask for Ifx_GETH_MAC_VERSION_Bits.USERVER */
#define IFX_GETH_MAC_VERSION_USERVER_MSK (0xffu)

/** \brief Offset for Ifx_GETH_MAC_VERSION_Bits.USERVER */
#define IFX_GETH_MAC_VERSION_USERVER_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_DEBUG_Bits.RPESTS */
#define IFX_GETH_MAC_DEBUG_RPESTS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_DEBUG_Bits.RPESTS */
#define IFX_GETH_MAC_DEBUG_RPESTS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_DEBUG_Bits.RPESTS */
#define IFX_GETH_MAC_DEBUG_RPESTS_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_DEBUG_Bits.RFCFCSTS */
#define IFX_GETH_MAC_DEBUG_RFCFCSTS_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_DEBUG_Bits.RFCFCSTS */
#define IFX_GETH_MAC_DEBUG_RFCFCSTS_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_DEBUG_Bits.RFCFCSTS */
#define IFX_GETH_MAC_DEBUG_RFCFCSTS_OFF (1u)

