dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxGeth_bf.h
/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTRGTERR0 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTRGTERR0_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTRGTERR0 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTRGTERR0_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTRGTERR0 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTRGTERR0_OFF (3u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTARGT1 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTARGT1_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTARGT1 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTARGT1_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTARGT1 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTARGT1_OFF (4u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTRGTERR1 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTRGTERR1_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTRGTERR1 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTRGTERR1_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTRGTERR1 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTRGTERR1_OFF (5u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTARGT2 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTARGT2_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTARGT2 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTARGT2_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTARGT2 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTARGT2_OFF (6u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTRGTERR2 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTRGTERR2_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTRGTERR2 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTRGTERR2_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTRGTERR2 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTRGTERR2_OFF (7u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTARGT3 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTARGT3_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTARGT3 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTARGT3_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTARGT3 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTARGT3_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTRGTERR3 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTRGTERR3_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTRGTERR3 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTRGTERR3_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TSTRGTERR3 */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TSTRGTERR3_OFF (9u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TXTSSIS */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TXTSSIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TXTSSIS */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TXTSSIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_STATUS_Bits.TXTSSIS */
#define IFX_GETH_MAC_TIMESTAMP_STATUS_TXTSSIS_OFF (15u)

/** \brief Length for Ifx_GETH_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_Bits.TXTSSLO */
#define IFX_GETH_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSLO_LEN (31u)

/** \brief Mask for Ifx_GETH_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_Bits.TXTSSLO */
#define IFX_GETH_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSLO_MSK (0x7fffffffu)

/** \brief Offset for Ifx_GETH_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_Bits.TXTSSLO */
#define IFX_GETH_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSLO_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_Bits.TXTSSMIS */
#define IFX_GETH_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSMIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_Bits.TXTSSMIS */
#define IFX_GETH_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSMIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_Bits.TXTSSMIS */
#define IFX_GETH_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSMIS_OFF (31u)

/** \brief Length for Ifx_GETH_MAC_TX_TIMESTAMP_STATUS_SECONDS_Bits.TXTSSHI */
#define IFX_GETH_MAC_TX_TIMESTAMP_STATUS_SECONDS_TXTSSHI_LEN (32u)

/** \brief Mask for Ifx_GETH_MAC_TX_TIMESTAMP_STATUS_SECONDS_Bits.TXTSSHI */
#define IFX_GETH_MAC_TX_TIMESTAMP_STATUS_SECONDS_TXTSSHI_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_MAC_TX_TIMESTAMP_STATUS_SECONDS_Bits.TXTSSHI */
#define IFX_GETH_MAC_TX_TIMESTAMP_STATUS_SECONDS_TXTSSHI_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_INGRESS_ASYM_CORR_Bits.OSTIAC */
#define IFX_GETH_MAC_TIMESTAMP_INGRESS_ASYM_CORR_OSTIAC_LEN (32u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_INGRESS_ASYM_CORR_Bits.OSTIAC */
#define IFX_GETH_MAC_TIMESTAMP_INGRESS_ASYM_CORR_OSTIAC_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_INGRESS_ASYM_CORR_Bits.OSTIAC */
#define IFX_GETH_MAC_TIMESTAMP_INGRESS_ASYM_CORR_OSTIAC_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_EGRESS_ASYM_CORR_Bits.OSTEAC */
#define IFX_GETH_MAC_TIMESTAMP_EGRESS_ASYM_CORR_OSTEAC_LEN (32u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_EGRESS_ASYM_CORR_Bits.OSTEAC */
#define IFX_GETH_MAC_TIMESTAMP_EGRESS_ASYM_CORR_OSTEAC_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_EGRESS_ASYM_CORR_Bits.OSTEAC */
#define IFX_GETH_MAC_TIMESTAMP_EGRESS_ASYM_CORR_OSTEAC_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_Bits.TSIC */
#define IFX_GETH_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_TSIC_LEN (32u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_Bits.TSIC */
#define IFX_GETH_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_TSIC_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_Bits.TSIC */
#define IFX_GETH_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_TSIC_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_Bits.TSEC */
#define IFX_GETH_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_TSEC_LEN (32u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_Bits.TSEC */
#define IFX_GETH_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_TSEC_MSK (0xffffffffu)

