dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxGeth_bf.h
/** \brief Length for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.RTC */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_RTC_LEN (2u)

/** \brief Mask for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.RTC */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_RTC_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.RTC */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_RTC_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.FUP */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_FUP_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.FUP */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_FUP_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.FUP */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_FUP_OFF (3u)

/** \brief Length for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.FEP */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_FEP_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.FEP */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_FEP_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.FEP */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_FEP_OFF (4u)

/** \brief Length for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.RSF */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_RSF_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.RSF */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_RSF_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.RSF */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_RSF_OFF (5u)

/** \brief Length for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.DIS_TCP_EF */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_DIS_TCP_EF_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.DIS_TCP_EF */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_DIS_TCP_EF_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.DIS_TCP_EF */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_DIS_TCP_EF_OFF (6u)

/** \brief Length for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.EHFC */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_EHFC_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.EHFC */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_EHFC_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.EHFC */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_EHFC_OFF (7u)

/** \brief Length for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.RFA */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_RFA_LEN (4u)

/** \brief Mask for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.RFA */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_RFA_MSK (0xfu)

/** \brief Offset for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.RFA */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_RFA_OFF (8u)

/** \brief Length for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.RFD */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_RFD_LEN (4u)

/** \brief Mask for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.RFD */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_RFD_MSK (0xfu)

/** \brief Offset for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.RFD */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_RFD_OFF (14u)

/** \brief Length for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.RQS */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_RQS_LEN (5u)

/** \brief Mask for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.RQS */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_RQS_MSK (0x1fu)

/** \brief Offset for Ifx_GETH_MTL_RXQ0_OPERATION_MODE_Bits.RQS */
#define IFX_GETH_MTL_RXQ0_OPERATION_MODE_RQS_OFF (20u)

/** \brief Length for Ifx_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_Bits.OVFPKTCNT */
#define IFX_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT_LEN (11u)

/** \brief Mask for Ifx_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_Bits.OVFPKTCNT */
#define IFX_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT_MSK (0x7ffu)

/** \brief Offset for Ifx_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_Bits.OVFPKTCNT */
#define IFX_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_Bits.OVFCNTOVF */
#define IFX_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OVFCNTOVF_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_Bits.OVFCNTOVF */
#define IFX_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OVFCNTOVF_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_Bits.OVFCNTOVF */
#define IFX_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OVFCNTOVF_OFF (11u)

/** \brief Length for Ifx_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_Bits.MISPKTCNT */
#define IFX_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT_LEN (11u)

/** \brief Mask for Ifx_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_Bits.MISPKTCNT */
#define IFX_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT_MSK (0x7ffu)

/** \brief Offset for Ifx_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_Bits.MISPKTCNT */
#define IFX_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT_OFF (16u)

/** \brief Length for Ifx_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_Bits.MISCNTOVF */
#define IFX_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_MISCNTOVF_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_Bits.MISCNTOVF */
#define IFX_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_MISCNTOVF_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_Bits.MISCNTOVF */
#define IFX_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_MISCNTOVF_OFF (27u)

/** \brief Length for Ifx_GETH_MTL_RXQ0_DEBUG_Bits.RWCSTS */
#define IFX_GETH_MTL_RXQ0_DEBUG_RWCSTS_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ0_DEBUG_Bits.RWCSTS */
#define IFX_GETH_MTL_RXQ0_DEBUG_RWCSTS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_RXQ0_DEBUG_Bits.RWCSTS */
#define IFX_GETH_MTL_RXQ0_DEBUG_RWCSTS_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_RXQ0_DEBUG_Bits.RRCSTS */
#define IFX_GETH_MTL_RXQ0_DEBUG_RRCSTS_LEN (2u)

/** \brief Mask for Ifx_GETH_MTL_RXQ0_DEBUG_Bits.RRCSTS */
#define IFX_GETH_MTL_RXQ0_DEBUG_RRCSTS_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MTL_RXQ0_DEBUG_Bits.RRCSTS */
#define IFX_GETH_MTL_RXQ0_DEBUG_RRCSTS_OFF (1u)

/** \brief Length for Ifx_GETH_MTL_RXQ0_DEBUG_Bits.RXQSTS */
#define IFX_GETH_MTL_RXQ0_DEBUG_RXQSTS_LEN (2u)

/** \brief Mask for Ifx_GETH_MTL_RXQ0_DEBUG_Bits.RXQSTS */
#define IFX_GETH_MTL_RXQ0_DEBUG_RXQSTS_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MTL_RXQ0_DEBUG_Bits.RXQSTS */
#define IFX_GETH_MTL_RXQ0_DEBUG_RXQSTS_OFF (4u)

/** \brief Length for Ifx_GETH_MTL_RXQ0_DEBUG_Bits.PRXQ */
#define IFX_GETH_MTL_RXQ0_DEBUG_PRXQ_LEN (14u)

/** \brief Mask for Ifx_GETH_MTL_RXQ0_DEBUG_Bits.PRXQ */
#define IFX_GETH_MTL_RXQ0_DEBUG_PRXQ_MSK (0x3fffu)

/** \brief Offset for Ifx_GETH_MTL_RXQ0_DEBUG_Bits.PRXQ */
#define IFX_GETH_MTL_RXQ0_DEBUG_PRXQ_OFF (16u)

